Revit 2027 API
FabricSheet.FabricHostReference Property
 Controls if Single Fabric Sheet should be cut by the Host Cover
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FabricHostReference FabricHostReference { get; set; }
Public Property FabricHostReference As FabricHostReference
	Get
	Set
public:
property FabricHostReference FabricHostReference {
	FabricHostReference get ();
	void set (FabricHostReference value);
}
member FabricHostReference : FabricHostReference with get, set
Property Value
FabricHostReference
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
FabricSheet Class
Autodesk.Revit.DB.Structure Namespace